{"sections":{"main-page":{"type":"page-template","disabled":true,"settings":{}},"bio_cleaning_banner_R6HgfF":{"type":"bio_cleaning_banner","settings":{"heading":"","bg_image":"shopify:\/\/shop_images\/banner.png","text":"Bring Your Items Back To Life","description":"Renew Leather, Revive Luxury","text_color":"#f26522","dec_color":"#1a1c15"}},"bc_text_image_section_aEMgiH":{"type":"bc--text_image_section","settings":{"image":"shopify:\/\/shop_images\/Rectangle_42.png","text":"How to extend the lifespan of your luxury?","description":"<p>An essential part of the luxury fashion industry is to be able to circulate products in an immaculate condition even if they are pre-loved. Our aim is to restore luxury items and give them a new life instead of having them tucked away in a closet or ending up in a landfill. <\/p><p>With years of experience and having worked on luxury products from major leading brands, we’re able to provide assurance to our clients that their product is in safe hands.<\/p><p>Product spa extends the life cycle and adds value to the product resulting in frequent usage, improved resale value as well as having a positive environmental impact. Spa at CC offers bespoke repairs and restoration services that will return your designer shoes, handbags and small leather goods to their former glory.<\/p>","btn_url":"shopify:\/\/pages\/spa-charges","btn_text":"PRICE LIST"}},"bc_image_text_section_FEVarr":{"type":"bc--image-text-section","blocks":{"image_text_block_zKw6n6":{"type":"image_text_block","settings":{"image":"shopify:\/\/shop_images\/bc-1.png","title":"Attention to Detail","description":"<p>ATTENTION TO DETAIL:  This is a delicate process that requires both time, effort, necessary tools and appliances. Understanding and identifying faults and issues in major areas and components of a product. Most of the time issues pertain to leather crackling, discoloration, active fungi, broken zipper, strap, and other significant accents.<\/p>"}},"image_text_block_9gARhD":{"type":"image_text_block","settings":{"image":"shopify:\/\/shop_images\/bc-2.png","title":"Expertise","description":"<p>With our extensive knowledge of all material, combined with our veteran experience, we are able to carry out a multitude of repairs on all products. Our experts have perfected solutions over a period of time to allow you to fully restore and protect your classic or retro items to be like new. <\/p>"}},"image_text_block_NMdXVN":{"type":"image_text_block","settings":{"image":"shopify:\/\/shop_images\/bc-3.png","title":"Increased Re-sale Value","description":"<p>When it comes to evaluating the resale value of any luxury product, it’s not just the popularity or exclusivity of the model that matters; the condition of the product is an important consideration for any resale and consignment platform you plan to take your product too. <\/p>"}},"image_text_block_MQ6R7j":{"type":"image_text_block","settings":{"image":"shopify:\/\/shop_images\/bc-4.png","title":"Product Handling & Client Support","description":"<p>Even though the product has to be restored, it is stored and handed with the utmost care. we work towards providing our clients a seamless service from the beginning to end. We provide a service that is convenient and thorough, the result is our clients enjoying their cherished item restored to its original state as close as possible. <\/p>"}}},"block_order":["image_text_block_zKw6n6","image_text_block_9gARhD","image_text_block_NMdXVN","image_text_block_MQ6R7j"],"settings":{"btn_url":"","btn_text":"Find the Spa charges Schedule here"}}},"order":["main-page","bio_cleaning_banner_R6HgfF","bc_text_image_section_aEMgiH","bc_image_text_section_FEVarr"]}