{"sections":{"main-page":{"type":"page-template","disabled":true,"settings":{}},"section_custom_html_gnJUha":{"type":"section-custom-html","custom_css":["p {color: #666666; font-size: 16px !important; font-weight: 400 !important; font-family: Jost, sans-serif; line-height: 1.71428571; padding-bottom: 25px;}"],"settings":{"section_gap_check":true,"col_pro_full_width_check":false,"custom_html":"<p>At C E Enterprises Pvt Ltd, we take immense pride in curating a collection of luxury handbags and accessories under the brand name Confidential Couture. Our commitment to offering pre-loved exceptional products and ensuring a seamless shopping experience is unwavering. However, we want to ensure that you are well-informed about our policies and practices. Please read the following disclaimer carefully:<\/p>\n<p>\n    1. Authenticity Guarantee:  We guarantee the authenticity of every luxury handbag and accessory available on Confidential Couture. All items undergo a rigorous authentication process by our experts to ensure that they meet the highest standards of quality and craftsmanship.<\/p>\n<p>2. Condition Disclosure:  We provide detailed descriptions and photographs of each product to give you a comprehensive understanding of its condition. Please note that pre-owned items may exhibit minor signs of wear, which will be clearly disclosed in the product description.<\/p>\n<p>\n    3. Pricing: Prices of our luxury handbags and accessories are determined based on factors such as brand, rarity, condition, and market demand. We strive to offer competitive pricing while maintaining the quality and authenticity of our products.<\/p>\n<p>4. Return Policy: We offer a hassle-free return policy for products that do not meet your expectations. Please review our Return Policy on our website for detailed information on the process and eligibility criteria.\n<\/p>\n\n    \n    <p>\n        5. Privacy and Security: Confidential Couture is committed to protecting your privacy and ensuring the security of your personal information. We do not share your data with third parties without your consent. Please refer to our Privacy Policy for more details.<\/p>\n    <p>6. Shipping and Delivery: We aim to deliver your purchase in the quickest and safest manner possible. Shipping times may vary depending on your location and the product's availability. You can find more information about shipping and delivery on our website.\n\n    <\/p>\n    <p>7. Customer Service: Our dedicated customer service team is available to assist you with any inquiries or concerns you may have. Please feel free to contact us through the provided channels for prompt assistance.\n\n    <\/p>\n    <p>8. Trademark and Copyright: The C E Enterprises Pvt Ltd logo, Confidential Couture brand name, and all related content, including product images and descriptions, are protected by trademark and copyright laws. Any unauthorized use or reproduction is strictly prohibited.\n\n    <\/p>\n    <p>9. Disclaimer Changes: C E Enterprises Pvt Ltd reserves the right to update or change this disclaimer at any time without prior notice. It is your responsibility to review this disclaimer periodically for any updates.\n\n    <\/p>\n    <p>Our main focus is to provide a convenient and reliable platform for individuals to buy and sell second-hand items. We aim to promote sustainability and reduce waste by encouraging the reuse of preloved items Confidential Couture doesn't intend to infringe the copyright.\n\n    <\/p>\n    <p>By using the Confidential Couture website and purchasing our luxury handbags and accessories, you acknowledge and agree to abide by the terms and conditions outlined in this disclaimer.\n\n    <\/p>\n    <p>Thank you for choosing Confidential Couture, where luxury meets authenticity and excellence. We look forward to serving you with the utmost dedication and integrity.\n\n    <\/p>"}}},"order":["main-page","section_custom_html_gnJUha"]}