{"sections":{"main-page":{"type":"page-template","disabled":true,"settings":{}},"section_custom_html_eANqi6":{"type":"section-custom-html","settings":{"section_gap_check":true,"col_pro_full_width_check":false,"custom_html":"<style>\n\n\n\np{\n    \n  margin-top: 0rem;\n  margin-bottom: 2.7rem;\n  line-height: 1.71428571;\n  color: #666666;\n  font-size: 16px !important;\n  font-weight: 400 !important;\n  font-family: Jost, sans-serif;\n}\n\nh2{\n    font-weight: 400 !important;\n    line-height: 1;\n    font-size: 2.5rem;\n    margin-top: 0rem;\n    margin-bottom: 1.7rem;\n    text-align: center;\n}\n\nh3 {\n  font-weight: 400 !important;\n  line-height: 1;\n  font-size: 1.8rem;\n  margin-top: 0rem;\n  margin-bottom: 1.7rem;\n}\n\n\n\n<\/style>\n\n\n\n\n\n\n\n<h2>Consignor’s<\/h2>\n\n<p>Terms Our goal is to sell your luxury apparels quickly while bringing the best value within the pre-owned luxury market. DELIVERY OF PROPERTY; RISK OF LOSS; INSURANCE Consignor makes the Property available to Confidential Couture on a consignment basis. Consignor will ensure that the consignment products are insured from all risks of fire, theft, and flood. Accidental damage or breakage, any acts of nature resulting or any damage to the property until agreed upon products are delivered to Confidential Couture at the contracted shipping address. The consignor retains all risk of loss or damage to the Property while the Property is in transit. All risk of loss or damage of the Property will pass to the Site when the Property is in Confidential Couture’s physical possession.<\/p>\n\n\n\n\n<ol>\n    <li>\n    <h3>ACCEPTANCE OF PROPERTY; CONDITION OF ITEMS AND AUTHENTICATION<\/h3>\n    <p>Confidential Couture only accepts apparels of a certain standard i.e. either Never been used or Pristine in condition. Upon receipt, we evaluate the Property to determine its condition, authenticity and quality. The consignor attests to the authenticity of all agreed upon items and confirms that they have not knowingly attempted to resell counterfeit products to Confidential Couture. Products deemed to be counterfeits will be returned to the consignor with the charges of authentication, shipping costs and also it will terminate the contact between the consignor and Confidential Couture. Items of Property that do not meet our authenticity or quality standards, or are not included in the Designer Directory will not be accepted and will be returned to Consignor at the Consignor’s expense.\n    <\/p>\n    <\/li>\n    <li>\n    <h3>EFFORTS TO SELL; PRICE<\/h3>\n    <p>Upon acceptance of the Property, Confidential Couture will display and make commercially reasonable efforts to sell the Property. Extensive efforts are put to sell the property like authentication, cleaning\/spa, photo shoot and media advertisements. Consignor acknowledges that the Site will designate the product category applicable to the Property. The Site will set the initial selling price for the Property, and the Site may change the selling price at its sole discretion from time to time without notice to Consignor. The Site reserves the right to run promotions on its website and by other means and to offer discounts to its customers at its sole discretion. Consignor acknowledges and agrees that items of its Property consigned hereunder may be advertised, displayed and sold with items belonging to other consignors. In case of no sale within the consignment period of the product, several efforts can be put for the products promotion, which may include reduction of price, by the consignors consent. However, if it’s not acceptable to the consignor the product is returned to you at delivery cost of Rs 300 within Delhi & Mumbai and Rs 500 for other states.<\/p>\n    <\/li>\n    <li>\n    <h3>Billing<\/h3>\n    <p>The price of our merchandise is inclusive of the GST. The GST charged should depend upon the destination where the order has to be shipped. The tax rate applied to the order will be the combined tax rate for both state and local tax rates in accordance with the address where the order is being shipped. We reserve the right to collect taxes for shipping charges wherever applicable. Please note that the tax implication should be the liability of the seller\/buyer Confidential Couture is only a facilitator of the transaction.<\/p>\n    <\/li>\n    <li>\n    <h3>Delivery<\/h3>\n    <p>We strive but do not guarantee to deliver the products to Users within 3-4 weeks from the day of close of sale depending upon the shipping location, only if one has opted for the service of Express Delivery, we guarantee the delivery in either 24-48 hours for which the charges are Rs 850\/- for 24 hours and Rs 550\/- for 48 hours. We work with different types of channel partners and the delivery time to Users is subject to delivery of products from supplier to us. Other factors include delay in delivery through the courier partner, transporters ‘strike etc. We reserve the right to make delivery of the goods by installments i.e., in case of an order containing several products. If the goods are to be delivered in installments, each delivery will constitute a separate invoice\/contract. You may not treat the contract (as a whole) as repudiated if we fail to deliver any one or more of the installments or if you have a claim in respect of any one or more of the installments. If you fail to take delivery of the goods, we may at our discretion charge you for the additional shipping cost. Please note we insure each purchase during the time it is in transit until it is delivered to your specified delivery address. We require a signature for any goods delivered, at which point responsibility for your purchased goods passes to you. If you have specified a third party recipient for delivery purposes (for example as a gift) then you accept that evidence of a signature by them (or at that delivery address) is evidence of delivery and fulfillment by us of our obligation, and transfer of responsibility in the same way. Kindly note that we aim to dispatch all orders within 24 hours, or 48 hours during sale periods. Estimated delivery times are to be used as a guide only and commence from the date of dispatch. We are not responsible for any delays caused by third party delivery agencies and\/or due to time required for statutory clearances during the delivery process.<\/p>\n    <\/li>\n    <li>\n    <h3>Refunds & Exchange<\/h3>\n    <p>We value our customers and offer the facility of exchange\/return of product, without any inconvenience.<\/p>\n    <p>EXCHANGE:<\/p>\n    <p>We welcome our customers for exchange of apparels; Intimation for exchange should be received within 24 hours from receipt of item. For exchange of product if he\/she desires to issue a credit note of the equivalent value, instantly, without any deduction. The credit note carries a validity of 12 months from the date of issue. The credit note is redeemable only once, for full value and the product sold against the credit note would not be further exchangeable.<\/p>\n    <p>RETURN:<\/p>\n    <p>For apparels we do not accept any returns. But if one wishes to re-sell their apparel with us, we accept it again for sale after a period of 2 months.<\/p>\n    <\/li>\n    <li>\n    <h3>TITLE OF PROPERTY<\/h3>\n    <p>Consignor attests that they have the legal title to and are in legal possession of all the apparels that Confidential Couture is to sell on behalf of them. Please note consignment does not mean sale of the product. The consignor legally gives the rights to Confidential Couture to sell their product. The legal ownership of the product is transferred to the buyer of the product on the day the product is purchased and shipped to the buyer and the consignor is notified. Please note in case of no sale, after informing the consignor periodically we store the item for a period of 90 days post consignment period .If ownership is not claimed within this time, Confidential Couture ceases the ownership of the item.<\/p>\n    <\/li>\n    <li>\n    <h3>DURATION OF CONTRACT AND TERMINATION<\/h3>\n    <p><br>The consignment period of a product is upto 3 months from the date the product is listed on the website. In the event of a premature termination of the agreement, the Consignor shall be liable to pay a compensation of Rs. 2500\/ for Products up to an indicative value of Rs.1,00,000\/ and Rs.3,500\/ for Products above that value.<\/p>\n    <\/li>\n    <li>\n    <h3>PAYMENTS<\/h3>\n    <p><br>Consignors are paid after their product is sold and payment has been cleared. The payment is scheduled within 40-45 working days of sale of the product. Authentication Authentication in all forms, whether it is of antiques, signatures, collectibles, etc. is a matter of opinion, handbags included. The only true 100% authority would be the manufacturer of the goods (sales executives and associates of respective brands are not to be considered). Our liability is limited to the cost of the authentication. Should you happen to get a different opinion from another qualified authentication service that is different from ours, we would be willing to re-evaluate the handbag, however, after re-evaluation our final determination on the bag will be issued and the matter closed. Money back guarantee will come to play IF AND ONLY IF the product is proved to be COUNTERFEIT by the designer itself in written documentation. The authentication is provided to you on an \"as is\" basis without any warranties of any kind. The company and the authenticators performing the authentication, to the fullest extent permitted by law, disclaim all warranties with regard to the authentication, including without limitation, the warranty of merchantability. The company and its authenticators make NO WARRANTIES about the accuracy, reliability, completeness, or timeliness of the authentication.<\/p>\n    <\/li>\n    <\/ol>\n    <p> <\/p>\n    <p>THANK YOU!<\/p>\n    <p> <\/p>"}}},"order":["main-page","section_custom_html_eANqi6"]}